In [1]:
import pandas as pd
import numpy as np

In [2]:
# dct = {"brand": "Ford","model": "Mustang", "year": 1964}
dct = {'a':[1,2,3,1], 'b':[4,5,6,7], 'c':[8,9,10,'11']}

dct_df = pd.DataFrame(dct)
print(type(dct_df))

<class 'pandas.core.frame.DataFrame'>

In [3]:
dct_df

   a  b   c
0  1  4   8
1  2  5   9
2  3  6  10
3  1  7  11

In [5]:
# .columns mainīgajā glabājas df kolonnu nosaukumi
dct_df.columns

Index(['a', 'b', 'c'], dtype='object')

In [10]:
# df var transponēt
dct_df.T

   0  1   2   3
a  1  2   3   1
b  4  5   6   7
c  8  9  10  11

In [11]:
# Kādu DF atgriezīs nākamās rindiņas atkomentēšana un palaišana?
dct_df

   a  b   c
0  1  4   8
1  2  5   9
2  3  6  10
3  1  7  11

In [12]:
dct_df.sum()
# Kāpēc saskaitīja tikai a un b kolonnas?

a     7
b    22
dtype: int64

In [ ]:
# Uzdevums: 
# Sameklējiet ko dara DataFrame objekta .to_numeric() funkcija

In [33]:
# pd.to_numeric(dct_df)
kolonna_c = dct_df['c']
kolonna_c = pd.to_numeric(kolonna_c)
dct_df['c'] = kolonna_c

In [34]:
dct_df.sum()

a     7
b    22
c    38
dtype: int64

In [20]:
# Izmantojot .head() funkciju var apskatīt df pirmos n elementus (pēc noklusējuma n = 20)
dct_df.head(6)

   a  b   c
0  1  4   8
1  2  5   9
2  3  6  10
3  1  7  11

In [21]:
kolonna = dct_df['a']
print(type(kolonna))

<class 'pandas.core.series.Series'>

In [22]:
kolonna

0    1
1    2
2    3
3    1
Name: a, dtype: int64

In [25]:
series_list = dict(kolonna)

In [27]:
kolonnas_DF = pd.DataFrame(kolonna)

In [28]:
kolonnas_DF

   a
0  1
1  2
2  3
3  1

In [35]:
kolonna.value_counts()

1    2
3    1
2    1
Name: a, dtype: int64

In [36]:
dct_df

   a  b   c
0  1  4   8
1  2  5   9
2  3  6  10
3  1  7  11

In [37]:
# Pandas dataframe pēc noklusējuma ir indeksēti
rindina = dct_df.loc[0]
print(type(rindina))

<class 'pandas.core.series.Series'>

In [38]:
rindina

a    1
b    4
c    8
Name: 0, dtype: int64

In [40]:
manually_indexed_df = pd.DataFrame(dct, index = ['pirma', 'otra', 'tresa', 'ceturta'])

In [41]:
manually_indexed_df

         a  b   c
pirma    1  4   8
otra     2  5   9
tresa    3  6  10
ceturta  1  7  11

In [ ]:
manually_indexed_df

In [42]:
dct_df

   a  b   c
0  1  4   8
1  2  5   9
2  3  6  10
3  1  7  11

In [43]:
# Rindu atlasīšana:
# Vairāki veidi. Viens no tiem: šķelt rindiņas ar būla mainīgo kolonnu
bool_col = [True, True, False, True]
dct_df[bool_col]

   a  b   c
0  1  4   8
1  2  5   9
3  1  7  11

In [44]:
# Pašā df arī var veidot šķēlumu
# Piemēri:
dct_df[dct_df['a'] == 1]

   a  b   c
0  1  4   8
3  1  7  11

In [45]:
some_df = pd.DataFrame(np.array(([1, 2, 3], [4, 5, 6])),
                  index=['mouse', 'rabbit'],
                  columns=['one', 'two', 'three'])

In [46]:
some_df

        one  two  three
mouse     1    2      3
rabbit    4    5      6

In [47]:
some_df.filter(items=['one', 'three'])

        one  three
mouse     1      3
rabbit    4      6

In [48]:
some_df

        one  two  three
mouse     1    2      3
rabbit    4    5      6

In [49]:
csv_df = pd.read_csv('/home/ubuntu/airtravel.csv')

In [50]:
csv_df

   Month   "1958"   "1959"   "1960"
0    JAN      340      360      417
1    FEB      318      342      391
2    MAR      362      406      419
3    APR      348      396      461
4    MAY      363      420      472
5    JUN      435      472      535
6    JUL      491      548      622
7    AUG      505      559      606
8    SEP      404      463      508
9    OCT      359      407      461
10   NOV      310      362      390
11   DEC      337      405      432

In [51]:
json_df = pd.read_json('lasams_json_piemers.json')

In [52]:
json_df

                                                    menu
id                                                  file
popup  {'menuitem': [{'value': 'New', 'onclick': 'Cre...
value                                               File

In [53]:
json_pandas_output = json_df.loc['popup']['menu']

In [54]:
print(type(json_pandas_output))
print(json_pandas_output)

<class 'dict'>
{'menuitem': [{'value': 'New', 'onclick': 'CreateNewDoc()'}, {'value': 'Open', 'onclick': 'OpenDoc()'}, {'value': 'Close', 'onclick': 'CloseDoc()'}]}

In [73]:
sum_res = csv_df.sum()

0     1117
1     1051
2     1187
3     1205
4     1255
5     1442
6     1661
7     1670
8     1375
9     1227
10    1062
11    1174
dtype: int64

In [ ]:
# Uzdevums: 
# Saskaitiet cik kopā ir bijuši avio pasažieri no 1958. gada līdz 1960. gadam izmantojot no airtravel.csv izveidoto DataFrame

In [ ]:
# Uzdevums: 
# Atrodiet un ieimportējiet pd DataFrame objektā kādu excel failu, izmantojot pd.read_excel() funkciju
# Izvēlieties kādu excel faila kolonnu un pārbaudiet vai visas vērtības šajā kolonnā ir unikālas.